#include <stdio.h>

#pragma warning(disable: 4996 4326 6031)

void main()
{
	배열 image에 {
		{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 },
		{ 1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1 },
		{ 1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1 },
		{ 1,1,1,0,0,0,1,1,0,0,1,1,1,1,1,1 },
		{ 1,1,0,0,0,0,0,0,0,0,1,1,1,1,1,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1 },
		{ 1,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1 },
		{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 } }로 초기화

	printf("변환전 이미지\n");
	display
	inverse
	printf("\n\n변환후 이미지\n");
	display
}

void display(int image[8][16])
{
	for (int r) {
		for (int c)
			putchar( '-' : '*');
		putchar('\n');
	}
}

void inverse(int img[8][16])
{
	for (int r)
		for (int c)
			img[r][c] =  0 <--> 1
}
